In [59]:
#Panda DataFrame

In [60]:
import pandas as pd
import numpy as np

In [61]:
from numpy.random import randn

In [62]:
#seed
#وظيفة الدالة هاي انو يمنع تغيير القيم العشوائية المنشئة 
np.random.seed(101)

In [63]:
df = pd.DataFrame(randn(5,4),columns='A B C D'.split(),index='E F G H N'.split())

In [64]:
df

          A         B         C         D
E  2.706850  0.628133  0.907969  0.503826
F  0.651118 -0.319318 -0.848077  0.605965
G -2.018168  0.740122  0.528813 -0.589001
H  0.188695 -0.758872 -0.933237  0.955057
N  0.190794  1.978757  2.605967  0.683509

In [65]:
df['A']

E    2.706850
F    0.651118
G   -2.018168
H    0.188695
N    0.190794
Name: A, dtype: float64

In [66]:
type(df['A'])

pandas.core.series.Series

In [67]:
df.abs()

          A         B         C         D
E  2.706850  0.628133  0.907969  0.503826
F  0.651118  0.319318  0.848077  0.605965
G  2.018168  0.740122  0.528813  0.589001
H  0.188695  0.758872  0.933237  0.955057
N  0.190794  1.978757  2.605967  0.683509

In [68]:
df[['A','B']]

          A         B
E  2.706850  0.628133
F  0.651118 -0.319318
G -2.018168  0.740122
H  0.188695 -0.758872
N  0.190794  1.978757

In [69]:
type(df[['A','B']])

pandas.core.frame.DataFrame

In [70]:
df['New'] = df['A'] + df['C']

In [71]:
df['New']

E    3.614819
F   -0.196959
G   -1.489355
H   -0.744542
N    2.796762
Name: New, dtype: float64

In [72]:
df

          A         B         C         D       New
E  2.706850  0.628133  0.907969  0.503826  3.614819
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959
G -2.018168  0.740122  0.528813 -0.589001 -1.489355
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542
N  0.190794  1.978757  2.605967  0.683509  2.796762

In [73]:
df.drop('New', axis=1)

          A         B         C         D
E  2.706850  0.628133  0.907969  0.503826
F  0.651118 -0.319318 -0.848077  0.605965
G -2.018168  0.740122  0.528813 -0.589001
H  0.188695 -0.758872 -0.933237  0.955057
N  0.190794  1.978757  2.605967  0.683509

In [74]:
df

          A         B         C         D       New
E  2.706850  0.628133  0.907969  0.503826  3.614819
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959
G -2.018168  0.740122  0.528813 -0.589001 -1.489355
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542
N  0.190794  1.978757  2.605967  0.683509  2.796762

In [75]:
df['New2'] = df['B'] + df['C']

In [76]:
df.drop('New2', axis=1)

          A         B         C         D       New
E  2.706850  0.628133  0.907969  0.503826  3.614819
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959
G -2.018168  0.740122  0.528813 -0.589001 -1.489355
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542
N  0.190794  1.978757  2.605967  0.683509  2.796762

In [77]:
#تأكيد الحذف 
df.drop('New2', axis=1,inplace=True)

In [78]:
df

          A         B         C         D       New
E  2.706850  0.628133  0.907969  0.503826  3.614819
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959
G -2.018168  0.740122  0.528813 -0.589001 -1.489355
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542
N  0.190794  1.978757  2.605967  0.683509  2.796762

In [79]:
df['New3'] = df['D'] + df['C']

In [80]:
df

          A         B         C         D       New      New3
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.242112
G -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.060187
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542  0.021819
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [81]:
df.shape

(5, 6)

In [82]:
#get rows by labels name
df.loc['E']

A       2.706850
B       0.628133
C       0.907969
D       0.503826
New     3.614819
New3    1.411795
Name: E, dtype: float64

In [83]:
#get rows by index number
df.iloc[2]

A      -2.018168
B       0.740122
C       0.528813
D      -0.589001
New    -1.489355
New3   -0.060187
Name: G, dtype: float64

In [84]:
#عشان يجيب خلية وحدة
df.loc['E','A']

2.706849839399938

In [85]:
#هيجيب الصفين مع العمودين هدول 
df.loc[['E','F'],['A','B']]

          A         B
E  2.706850  0.628133
F  0.651118 -0.319318

In [86]:
#المقارنات والشروط
booldf = df > 0

In [87]:
booldf

       A      B      C      D    New   New3
E   True   True   True   True   True   True
F   True  False  False   True  False  False
G  False   True   True  False  False  False
H   True  False  False   True  False   True
N   True   True   True   True   True   True

In [88]:
df[booldf]

          A         B         C         D       New      New3
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
F  0.651118       NaN       NaN  0.605965       NaN       NaN
G       NaN  0.740122  0.528813       NaN       NaN       NaN
H  0.188695       NaN       NaN  0.955057       NaN  0.021819
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [89]:
df[df>0]

          A         B         C         D       New      New3
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
F  0.651118       NaN       NaN  0.605965       NaN       NaN
G       NaN  0.740122  0.528813       NaN       NaN       NaN
H  0.188695       NaN       NaN  0.955057       NaN  0.021819
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [90]:
df['A']>0

E     True
F     True
G    False
H     True
N     True
Name: A, dtype: bool

In [91]:
df[df['A']>0]

          A         B         C         D       New      New3
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.242112
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542  0.021819
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [92]:
df

          A         B         C         D       New      New3
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.242112
G -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.060187
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542  0.021819
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [93]:
resultdf= df[df['D']<0]

In [94]:
resultdf

          A         B         C         D       New      New3
G -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.060187

In [95]:
resultdf['C']

G    0.528813
Name: C, dtype: float64

In [96]:
resultdf= df[df['D']<0][['A','B']]

In [97]:
resultdf

          A         B
G -2.018168  0.740122

In [98]:
df[(df['A']>0) & (df['B']>0)]

          A         B         C         D       New      New3
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [99]:
df[(df['A']>0) | (df['B']<0)]

          A         B         C         D       New      New3
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.242112
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542  0.021819
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [100]:
df.reset_index()

  index         A         B         C         D       New      New3
0     E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795
1     F  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.242112
2     G -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.060187
3     H  0.188695 -0.758872 -0.933237  0.955057 -0.744542  0.021819
4     N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476

In [101]:
newIndex = 'CA NY WY OR CO'.split()

In [102]:
newIndex

['CA', 'NY', 'WY', 'OR', 'CO']

In [103]:
df['states'] = newIndex

In [104]:
df

          A         B         C         D       New      New3 states
E  2.706850  0.628133  0.907969  0.503826  3.614819  1.411795     CA
F  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.242112     NY
G -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.060187     WY
H  0.188695 -0.758872 -0.933237  0.955057 -0.744542  0.021819     OR
N  0.190794  1.978757  2.605967  0.683509  2.796762  3.289476     CO

In [105]:
df.set_index('states',inplace=True)

In [106]:
#Multi index and index Hierarchy

In [107]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [108]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [109]:
inside

[1, 2, 3, 1, 2, 3]

In [110]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [111]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [112]:
from numpy.random import randn
np.random.seed(101)

In [113]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [114]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [115]:
df.loc['G1']

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [116]:
df.loc['G1'].loc[1]

A    2.706850
B    0.628133
Name: 1, dtype: float64

In [117]:
df.index.names

FrozenList([None, None])

In [118]:
df.index.names = ['Group', 'Num']

In [119]:
df

                  A         B
Group Num
G1    1    2.706850  0.628133
      2    0.907969  0.503826
      3    0.651118 -0.319318
G2    1   -0.848077  0.605965
      2   -2.018168  0.740122
      3    0.528813 -0.589001

In [120]:
df.loc['G2']

            A         B
Num
1   -0.848077  0.605965
2   -2.018168  0.740122
3    0.528813 -0.589001

In [121]:
df.loc['G2'].loc[2]

A   -2.018168
B    0.740122
Name: 2, dtype: float64

In [122]:
df.loc['G2'].loc[2].loc['B']

0.7401220570561068

In [123]:
df.xs('G1')

            A         B
Num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [124]:
df.xs(['G1',1])

A    2.706850
B    0.628133
Name: (G1, 1), dtype: float64

In [125]:
df.xs(1,level='Num')

              A         B
Group
G1     2.706850  0.628133
G2    -0.848077  0.605965

In [126]:
#Panada - Missing Data

In [127]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [128]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [129]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [130]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [131]:
#شيل الصفوف اللي فيها اكتر من وحدة nan
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [132]:
#Replace none value to another word
df.fillna(value='Value')

       A      B  C
0      1      5  1
1      2  Value  2
2  Value  Value  3

In [133]:
#حساب المتوسط 
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [134]:
#Panda - Groupby

In [135]:
data = {'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Gharile','Any','Vanessa','Car1','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [136]:
df = pd.DataFrame(data)

In [137]:
df

  company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Gharile    120
2    MSFT      Any    340
3    MSFT  Vanessa    124
4      FB     Car1    243
5      FB    Sarah    350

In [138]:
byComp = df.groupby('company')

In [139]:
byComp.mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [140]:
byComp.sum()

         Sales
company
FB         593
GOOG       320
MSFT       464

In [141]:
byComp.std()

              Sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [142]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [143]:
#ارجاع اقل بائعين محققين مبيعات من كل شركة وليس حسب الحروف
df.groupby('company').min()

          Person  Sales
company
FB          Car1    243
GOOG     Gharile    120
MSFT         Any    124

In [144]:
df.groupby('company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [145]:
df.groupby('company').describe().transpose()

company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [146]:
#Panadas MERGING, JOINING AND CON.

In [147]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'],
                   'key':['k0','k1','k2','k3']},
                  index=[0,1,2,3])

In [148]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7'],
                   'key':['k0','k0','k6','k7']},
                  index=[4,5,6,7])

In [149]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11'],
                  'key':['k0','k1','k10','k11'] },
                  index=[8,9,10,11])

In [150]:
df1

    A   B   C   D key
0  A0  B0  C0  D0  k0
1  A1  B1  C1  D1  k1
2  A2  B2  C2  D2  k2
3  A3  B3  C3  D3  k3

In [151]:
df2

    A   B   C   D key
4  A4  B4  C4  D4  k0
5  A5  B5  C5  D5  k0
6  A6  B6  C6  D6  k6
7  A7  B7  C7  D7  k7

In [152]:
df3

      A    B    C    D  key
8    A8   B8   C8   D8   k0
9    A9   B9   C9   D9   k1
10  A10  B10  C10  D10  k10
11  A11  B11  C11  D11  k11

In [153]:
pd.concat([df1,df2,df3])

      A    B    C    D  key
0    A0   B0   C0   D0   k0
1    A1   B1   C1   D1   k1
2    A2   B2   C2   D2   k2
3    A3   B3   C3   D3   k3
4    A4   B4   C4   D4   k0
5    A5   B5   C5   D5   k0
6    A6   B6   C6   D6   k6
7    A7   B7   C7   D7   k7
8    A8   B8   C8   D8   k0
9    A9   B9   C9   D9   k1
10  A10  B10  C10  D10  k10
11  A11  B11  C11  D11  k11

In [154]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D  key    A    B    C    D  key    A    B    C    D  key
0    A0   B0   C0   D0   k0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1   k1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2   k2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   k3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN  NaN   A4   B4   C4   D4   k0  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN  NaN   A5   B5   C5   D5   k0  NaN  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN  NaN   A6   B6   C6   D6   k6  NaN  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN  NaN   A7   B7   C7   D7   k7  NaN  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8   k0
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9   k1
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10  k10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11  k11

In [155]:
pd.merge(df1,df2,how='inner',on='key')

  A_x B_x C_x D_x key A_y B_y C_y D_y
0  A0  B0  C0  D0  k0  A4  B4  C4  D4
1  A0  B0  C0  D0  k0  A5  B5  C5  D5

In [156]:
pd.merge(df1,df2,how='outer',on='key')

   A_x  B_x  C_x  D_x key  A_y  B_y  C_y  D_y
0   A0   B0   C0   D0  k0   A4   B4   C4   D4
1   A0   B0   C0   D0  k0   A5   B5   C5   D5
2   A1   B1   C1   D1  k1  NaN  NaN  NaN  NaN
3   A2   B2   C2   D2  k2  NaN  NaN  NaN  NaN
4   A3   B3   C3   D3  k3  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN  k6   A6   B6   C6   D6
6  NaN  NaN  NaN  NaN  k7   A7   B7   C7   D7

In [157]:
pd.merge(df1,df2,on=['key'])

  A_x B_x C_x D_x key A_y B_y C_y D_y
0  A0  B0  C0  D0  k0  A4  B4  C4  D4
1  A0  B0  C0  D0  k0  A5  B5  C5  D5

In [158]:
#Panadas - operations

In [159]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,777],'col3':['abc','def','ghi','xyz']})

In [160]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [161]:
df['col2'].unique()

array([444, 555, 666, 777], dtype=int64)

In [162]:
#number unique values
df['col2'].nunique()

4

In [163]:
df['col2'].value_counts()

444    1
555    1
666    1
777    1
Name: col2, dtype: int64

In [164]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   777  xyz

In [165]:
df[(df['col1'] > 2) & (df['col2'] == 444 )]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [166]:
df['col1'].sum()

10

In [167]:
def times2(x):
    return x*2

In [168]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [169]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [170]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [171]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [172]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [173]:
df.sort_index

<bound method DataFrame.sort_index of    col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz>

In [174]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [175]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [176]:
pwd

'G:\\AI\\UdemyCourse'

In [178]:
pd.read_csv('salam.csv')

Empty DataFrame
Columns: [1, 2, 3, 4, 5, 6]
Index: []

In [182]:
df = pd.read_csv('salam.csv').to_csv('My_Output',index=False)

In [183]:
pd.read_csv('My_Output')

Empty DataFrame
Columns: [1, 2, 3, 4, 5, 6]
Index: []

In [189]:
#pd.read_excel('',sheet_name='sheet1')
#df.to_excel('salam_2.csv',sheet_name='salam')

In [190]:
#التعامل مع ملفات الاتش تي ام ال 
#data = pd.read_html('')
#type(data)
#data[0]

In [202]:
#التعامل مع sql file 
#from sqlalchemy import create_engine
#engine = create_engine('sqlite:///:memory:')
#df.to_sql('My_Table' , engine)
#sql_df = pd.read_sql('My_Table',con=engine)